Myrottenpotatoes/app/controllers/movies_controller.rb

def index
if update_session
flash.keep
redirect_to movies_path(params)
return
end
@movies = Movie.scoped
@movies = @movies.where(:rating => params[:ratings].keys)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY release_date ASC

def update
@movie = Movie.find params[:id]
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]